package expriment.experiment01.print;

public class Print {
    public static void main(String[] args) {
        System.out.println("串行检索时间为: 272ms 次数分别为: 18  280\n" +
                "并行检索时间为: 30ms 线程数: 8  加速比为:9.07  次数分别为: 贾宝玉18  林黛玉280");
//                "并行检索时间为: 106ms 线程数: 1  加速比为:2.57  次数分别为: 贾宝玉18  林黛玉280\n" +
//                "并行检索时间为: 41ms 线程数: 2  加速比为:6.63  次数分别为: 贾宝玉18  林黛玉280\n" +
//                "并行检索时间为: 66ms 线程数: 4  加速比为:4.12  次数分别为: 贾宝玉18  林黛玉280\n" +
//                "并行检索时间为: 30ms 线程数: 8  加速比为:9.07  次数分别为: 贾宝玉18  林黛玉280");
    }
}